import { IAuthor } from "./IAuthor";

const testImg = "../public/fakeImg/1.jpg";
const avatarImg = "../public/fakeImg/avatar.jpg";

export interface IReaction {
  likesCount: number;
  commentsCount: number;
}

export interface IPost {
  img: string;
  title: string;
  description: string;
  author: IAuthor;
  date: string; // this is for test. use Date type
  category: string;
  reactions: IReaction;
  content: string;
  tags: string[];
}

export const fakePosts: IPost[] = [
  {
    img: testImg,
    author: {
      img: avatarImg,
      name: "علی صحرابی",
    },
    category: "علی صحرابی",
    date: "1399/02/25",
    description:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
    reactions: { commentsCount: 12, likesCount: 13 },
    title: "راه رو بیمارستان چگونه باید باشد تا مناسب رفت و آمد باشد؟",
    content:
      "مجموعه تلویزیونی خاطرات الحمرا (Alhambeura Goongjeonui Chooeok) سریالی درام محصول کشور کره‌جنوبی به کارگردانی گیل هو آن است که پخش آن از سال ۲۰۱۸ در شبکه نتفلیکس آغاز شد. بازیگرانی چون شین های پارک، هیون بین، چان یئول پارک، مار آلسیوس، هیون چول چو و هان بو رئوم در آن به ایفای نقش پرداخته‌اند. خاطرات الحمرا به عنوان یکی از پرطرفدارترین سریال‌های درام در کره‌جنوبی شناخته می‌شود و در ساخت آن برای نخستین بار از فناوری واقعیت افزوده با الهام از بازی پوکمون گو استفاده شده است. شیوه روایت داستان، جلوه‌های ویژه تصویری و گرافیک کامپیوتری با کیفیت بالای این سریال تحسین مخاطبان و منتقدین را به دنبال داشته است. نسخه اصلی این سریال هم اکنون با زیرنویس فارسی از وبسایت دوستی ها تقدیم به علاقمندان شده است.",
    tags: ["سریال کره ای", "اموزش", "مشتری مداری"],
  },
  {
    img: testImg,
    author: {
      img: avatarImg,
      name: "علی صحرابی",
    },
    category: "علی صحرابی",
    date: "1399/02/25",
    description:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
    reactions: { commentsCount: 12, likesCount: 13 },
    title: "راه رو بیمارستان چگونه باید باشد تا مناسب رفت و آمد باشد؟",
    content:
      "مجموعه تلویزیونی خاطرات الحمرا (Alhambeura Goongjeonui Chooeok) سریالی درام محصول کشور کره‌جنوبی به کارگردانی گیل هو آن است که پخش آن از سال ۲۰۱۸ در شبکه نتفلیکس آغاز شد. بازیگرانی چون شین های پارک، هیون بین، چان یئول پارک، مار آلسیوس، هیون چول چو و هان بو رئوم در آن به ایفای نقش پرداخته‌اند. خاطرات الحمرا به عنوان یکی از پرطرفدارترین سریال‌های درام در کره‌جنوبی شناخته می‌شود و در ساخت آن برای نخستین بار از فناوری واقعیت افزوده با الهام از بازی پوکمون گو استفاده شده است. شیوه روایت داستان، جلوه‌های ویژه تصویری و گرافیک کامپیوتری با کیفیت بالای این سریال تحسین مخاطبان و منتقدین را به دنبال داشته است. نسخه اصلی این سریال هم اکنون با زیرنویس فارسی از وبسایت دوستی ها تقدیم به علاقمندان شده است.",
    tags: ["سریال کره ای", "اموزش", "مشتری مداری"],
  },
  {
    img: testImg,
    author: {
      img: avatarImg,
      name: "علی صحرابی",
    },
    category: "علی صحرابی",
    date: "1399/02/25",
    description:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
    reactions: { commentsCount: 12, likesCount: 13 },
    title: "راه رو بیمارستان چگونه باید باشد تا مناسب رفت و آمد باشد؟",
    content:
      "مجموعه تلویزیونی خاطرات الحمرا (Alhambeura Goongjeonui Chooeok) سریالی درام محصول کشور کره‌جنوبی به کارگردانی گیل هو آن است که پخش آن از سال ۲۰۱۸ در شبکه نتفلیکس آغاز شد. بازیگرانی چون شین های پارک، هیون بین، چان یئول پارک، مار آلسیوس، هیون چول چو و هان بو رئوم در آن به ایفای نقش پرداخته‌اند. خاطرات الحمرا به عنوان یکی از پرطرفدارترین سریال‌های درام در کره‌جنوبی شناخته می‌شود و در ساخت آن برای نخستین بار از فناوری واقعیت افزوده با الهام از بازی پوکمون گو استفاده شده است. شیوه روایت داستان، جلوه‌های ویژه تصویری و گرافیک کامپیوتری با کیفیت بالای این سریال تحسین مخاطبان و منتقدین را به دنبال داشته است. نسخه اصلی این سریال هم اکنون با زیرنویس فارسی از وبسایت دوستی ها تقدیم به علاقمندان شده است.",
    tags: ["سریال کره ای", "اموزش", "مشتری مداری"],
  },
  {
    img: testImg,
    author: {
      img: avatarImg,
      name: "علی صحرابی",
    },
    category: "علی صحرابی",
    date: "1399/02/25",
    description:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
    reactions: { commentsCount: 12, likesCount: 13 },
    title: "راه رو بیمارستان چگونه باید باشد تا مناسب رفت و آمد باشد؟",
    content:
      "مجموعه تلویزیونی خاطرات الحمرا (Alhambeura Goongjeonui Chooeok) سریالی درام محصول کشور کره‌جنوبی به کارگردانی گیل هو آن است که پخش آن از سال ۲۰۱۸ در شبکه نتفلیکس آغاز شد. بازیگرانی چون شین های پارک، هیون بین، چان یئول پارک، مار آلسیوس، هیون چول چو و هان بو رئوم در آن به ایفای نقش پرداخته‌اند. خاطرات الحمرا به عنوان یکی از پرطرفدارترین سریال‌های درام در کره‌جنوبی شناخته می‌شود و در ساخت آن برای نخستین بار از فناوری واقعیت افزوده با الهام از بازی پوکمون گو استفاده شده است. شیوه روایت داستان، جلوه‌های ویژه تصویری و گرافیک کامپیوتری با کیفیت بالای این سریال تحسین مخاطبان و منتقدین را به دنبال داشته است. نسخه اصلی این سریال هم اکنون با زیرنویس فارسی از وبسایت دوستی ها تقدیم به علاقمندان شده است.",
    tags: ["سریال کره ای", "اموزش", "مشتری مداری"],
  },
  {
    img: testImg,
    author: {
      img: avatarImg,
      name: "علی صحرابی",
    },
    category: "علی صحرابی",
    date: "1399/02/25",
    description:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
    reactions: { commentsCount: 12, likesCount: 13 },
    title: "راه رو بیمارستان چگونه باید باشد تا مناسب رفت و آمد باشد؟",
    content:
      "مجموعه تلویزیونی خاطرات الحمرا (Alhambeura Goongjeonui Chooeok) سریالی درام محصول کشور کره‌جنوبی به کارگردانی گیل هو آن است که پخش آن از سال ۲۰۱۸ در شبکه نتفلیکس آغاز شد. بازیگرانی چون شین های پارک، هیون بین، چان یئول پارک، مار آلسیوس، هیون چول چو و هان بو رئوم در آن به ایفای نقش پرداخته‌اند. خاطرات الحمرا به عنوان یکی از پرطرفدارترین سریال‌های درام در کره‌جنوبی شناخته می‌شود و در ساخت آن برای نخستین بار از فناوری واقعیت افزوده با الهام از بازی پوکمون گو استفاده شده است. شیوه روایت داستان، جلوه‌های ویژه تصویری و گرافیک کامپیوتری با کیفیت بالای این سریال تحسین مخاطبان و منتقدین را به دنبال داشته است. نسخه اصلی این سریال هم اکنون با زیرنویس فارسی از وبسایت دوستی ها تقدیم به علاقمندان شده است.",
    tags: ["سریال کره ای", "اموزش", "مشتری مداری"],
  },
  {
    img: testImg,
    author: {
      img: avatarImg,
      name: "علی صحرابی",
    },
    category: "علی صحرابی",
    date: "1399/02/25",
    description:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
    reactions: { commentsCount: 12, likesCount: 13 },
    title: "راه رو بیمارستان چگونه باید باشد تا مناسب رفت و آمد باشد؟",
    content:
      "مجموعه تلویزیونی خاطرات الحمرا (Alhambeura Goongjeonui Chooeok) سریالی درام محصول کشور کره‌جنوبی به کارگردانی گیل هو آن است که پخش آن از سال ۲۰۱۸ در شبکه نتفلیکس آغاز شد. بازیگرانی چون شین های پارک، هیون بین، چان یئول پارک، مار آلسیوس، هیون چول چو و هان بو رئوم در آن به ایفای نقش پرداخته‌اند. خاطرات الحمرا به عنوان یکی از پرطرفدارترین سریال‌های درام در کره‌جنوبی شناخته می‌شود و در ساخت آن برای نخستین بار از فناوری واقعیت افزوده با الهام از بازی پوکمون گو استفاده شده است. شیوه روایت داستان، جلوه‌های ویژه تصویری و گرافیک کامپیوتری با کیفیت بالای این سریال تحسین مخاطبان و منتقدین را به دنبال داشته است. نسخه اصلی این سریال هم اکنون با زیرنویس فارسی از وبسایت دوستی ها تقدیم به علاقمندان شده است.",
    tags: ["سریال کره ای", "اموزش", "مشتری مداری"],
  },
];
