export interface IQuestionAnswer {
  question: string;
  answer: string;
}

export const fakeQuestions: IQuestionAnswer[] = [
  {
    question: "چگونه در سامانه ساتک ثبت نام کنیم؟",
    answer:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
  },
  {
    question: "چگونه در سامانه ساتک ثبت نام کنیم؟",
    answer:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
  },
  {
    question: "چگونه در سامانه ساتک ثبت نام کنیم؟",
    answer:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
  },
  {
    question: "چگونه در سامانه ساتک ثبت نام کنیم؟",
    answer:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
  },
  {
    question: "چگونه در سامانه ساتک ثبت نام کنیم؟",
    answer:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
  },
  {
    question: "چگونه در سامانه ساتک ثبت نام کنیم؟",
    answer:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
  },
  {
    question: "چگونه در سامانه ساتک ثبت نام کنیم؟",
    answer:
      "طبق آخرین گزارشات شرکت گوشی سازی در ایران اعلام کرد که میتوانید از طریق رفتن به تنظیمات گگوشی خود اقدام به تغییر رمز عبور خود کنید و به همین سادگی می توانید از گوشی خود مراقبت کنید و امینت را بالا ببرید",
  },
];
